IDEA Open Model
ConcreteSLSCheckResultStressLimitationEc2 Class
Compatible with IDEA StatiCa Beta 20.0
 SLS Check Stress Limitation Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultStressLimitation
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultStressLimitationEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ConcreteSLSCheckResultStressLimitationEc2 : ConcreteSLSCheckResultStressLimitation
Public Class ConcreteSLSCheckResultStressLimitationEc2
	Inherits ConcreteSLSCheckResultStressLimitation
The ConcreteSLSCheckResultStressLimitationEc2 type exposes the following members.
Constructors
Name | Description
ConcreteSLSCheckResultStressLimitationEc2
Initializes a new instance of the ConcreteSLSCheckResultStressLimitationEc2 class
Top
Properties
Name | Description
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
LimitStress
 type of SLS limit stress check
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Stress
 type of SLS limit stress check
TypeCheck
 type of SLS limit stress check
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace